In [1]:
import numpy as np

In [32]:
import pandas as pd

In [ ]:
#creating DataFrame

In [30]:
data={
    'Name': ['Nida', 'Maha', 'Sana', 'Fizza'],
    'Age' : [20, 31, 45, 50],
    'City': ['Khi', 'lhr', 'isl', 'fsb'],
    'Salary': [200000, 50000, 300000, 100000]
}
df = pd.DataFrame(data)
df

    Name  Age City  Salary
0   Nida   20  Khi  200000
1   Maha   31  lhr   50000
2   Sana   45  isl  300000
3  Fizza   50  fsb  100000

In [10]:
data_list = [
    ['Nida', 20, 'khi', 200000],
    ['Maha', 21, 'lhr', 50000],
    ['Sana', 22, 'isl',300000],
    ['Fiza', 19, 'fsb', 100000]
]
df2 = pd.DataFrame(data_list)
df2

      0   1    2       3
0  Nida  20  khi  200000
1  Maha  21  lhr   50000
2  Sana  22  isl  300000
3  Fiza  19  fsb  100000

In [11]:
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns= columns)
df2

   Name  Age City  Salary
0  Nida   20  khi  200000
1  Maha   21  lhr   50000
2  Sana   22  isl  300000
3  Fiza   19  fsb  100000

In [12]:
df

    Name  Age City  Salary
0   Nida   20  Khi  200000
1   Maha   21  lhr   50000
2   Sana   22  isl  300000
3  Fizza   19  fsb  100000

In [ ]:
#selection and indexing of columns

In [13]:
df['Name']

0     Nida
1     Maha
2     Sana
3    Fizza
Name: Name, dtype: object

In [14]:
df[['Name', 'City']]

    Name City
0   Nida  Khi
1   Maha  lhr
2   Sana  isl
3  Fizza  fsb

In [ ]:
#creating a new column

In [15]:
df['Designation'] = ['Dr', 'Engr.', 'Lawyer','Teacher']
df

    Name  Age City  Salary Designation
0   Nida   20  Khi  200000          Dr
1   Maha   21  lhr   50000       Engr.
2   Sana   22  isl  300000      Lawyer
3  Fizza   19  fsb  100000     Teacher

In [ ]:
#removing a column

In [17]:
df

    Name  Age City  Salary Designation
0   Nida   20  Khi  200000          Dr
1   Maha   21  lhr   50000       Engr.
2   Sana   22  isl  300000      Lawyer
3  Fizza   19  fsb  100000     Teacher

In [18]:
df.drop('Designation', axis=1, inplace=True)
df

    Name  Age City  Salary
0   Nida   20  Khi  200000
1   Maha   21  lhr   50000
2   Sana   22  isl  300000
3  Fizza   19  fsb  100000

In [19]:
df

    Name  Age City  Salary
0   Nida   20  Khi  200000
1   Maha   21  lhr   50000
2   Sana   22  isl  300000
3  Fizza   19  fsb  100000

In [ ]:
#remove a row

In [24]:
df.drop(0, axis=0)

    Name  Age City  Salary
1   Maha   21  lhr   50000
2   Sana   22  isl  300000
3  Fizza   19  fsb  100000

In [ ]:
#selecting a row

In [25]:
df.loc[1]

Name       Maha
Age          21
City        lhr
Salary    50000
Name: 1, dtype: object

In [ ]:
#select a subset of row and column

In [26]:
df.loc[[0, 1]]

   Name  Age City  Salary
0  Nida   20  Khi  200000
1  Maha   21  lhr   50000

In [28]:
df.loc[[2,3]] [['Name', 'Age']]

    Name  Age
2   Sana   22
3  Fizza   19

In [ ]:
#conditional seclection

In [31]:
df

    Name  Age City  Salary
0   Nida   20  Khi  200000
1   Maha   31  lhr   50000
2   Sana   45  isl  300000
3  Fizza   50  fsb  100000

In [35]:
df[df['Age']> 30]

    Name  Age City  Salary
1   Maha   31  lhr   50000
2   Sana   45  isl  300000
3  Fizza   50  fsb  100000

In [39]:
df[(df['Age']> 30) & (df['City'] == 'khi')]

Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []

In [40]:
df[(df['Age']> 30) & (df['City'] == 'lhr')]

   Name  Age City  Salary
1  Maha   31  lhr   50000